#### Terraform Plan
```
module.aws_networking.aws_vpc.main: Refreshing state... [id=vpc-016bbeea8526d5f58]
module.aws_networking.aws_internet_gateway.main: Refreshing state... [id=igw-0b5b01cb015df292f]
module.aws_networking.aws_subnet.subnets["app"]: Refreshing state... [id=subnet-05bbdfb60f41ce438]
module.aws_networking.aws_subnet.subnets["db"]: Refreshing state... [id=subnet-0b8781f74575383db]
module.aws_networking.aws_subnet.subnets["web"]: Refreshing state... [id=subnet-0d13903da22fd4227]
module.aws_networking.aws_route_table.public: Refreshing state... [id=rtb-029732a8671afd367]
module.aws_networking.aws_route_table_association.public["web"]: Refreshing state... [id=rtbassoc-07ee8d0ca01b9f87a]
module.infoblox_ipam.bloxone_ipam_ip_space.main: Refreshing state... [id=ipam/ip_space/f08c1798-189a-11f1-b553-b208658ccad4]
module.infoblox_ipam.bloxone_ipam_address_block.main: Refreshing state... [id=ipam/address_block/f0ae43ad-189a-11f1-a51d-8e3fd8f87ff6]
module.infoblox_ipam.bloxone_ipam_subnet.subnets["web"]: Refreshing state... [id=ipam/subnet/f0e0150b-189a-11f1-b553-b208658ccad4]
module.infoblox_ipam.bloxone_ipam_subnet.subnets["db"]: Refreshing state... [id=ipam/subnet/f0e253ed-189a-11f1-a51d-8e3fd8f87ff6]
module.infoblox_ipam.bloxone_ipam_subnet.subnets["app"]: Refreshing state... [id=ipam/subnet/f0dfdc69-189a-11f1-8aeb-da11c5c4d936]
module.infoblox_dns.bloxone_dns_view.main: Refreshing state... [id=dns/view/5ee0cadd-1543-4eca-b98a-86308eb9c107]
module.infoblox_dns.bloxone_dns_auth_zone.main: Refreshing state... [id=dns/auth_zone/e6df1a79-3cf1-4c65-9542-3fcdb37c8eb9]
module.infoblox_dns.bloxone_dns_a_record.initial["api"]: Refreshing state... [id=dns/record/0cf3be90-27a6-4f7c-bf86-a731fa66b82c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infoblox_dns.bloxone_dns_a_record.initial["monitoring"] will be created
  + resource "bloxone_dns_a_record" "initial" {
      + absolute_name_spec     = (known after apply)
      + absolute_zone_name     = (known after apply)
      + comment                = "Monitoring dashboard endpoint"
      + created_at             = (known after apply)
      + delegation             = (known after apply)
      + disabled               = false
      + dns_absolute_name_spec = (known after apply)
      + dns_absolute_zone_name = (known after apply)
      + dns_name_in_zone       = (known after apply)
      + dns_rdata              = (known after apply)
      + id                     = (known after apply)
      + inheritance_sources    = (known after apply)
      + ipam_host              = (known after apply)
      + name_in_zone           = "monitoring"
      + provider_metadata      = (known after apply)
      + rdata                  = {
          + address = "172.20.10.20"
        }
      + source                 = (known after apply)
      + subtype                = (known after apply)
      + tags_all               = (known after apply)
      + ttl                    = (known after apply)
      + type                   = (known after apply)
      + updated_at             = (known after apply)
      + view                   = (known after apply)
      + view_name              = (known after apply)
      + zone                   = "dns/auth_zone/e6df1a79-3cf1-4c65-9542-3fcdb37c8eb9"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Pushed by: @ischraub, Environment: dev*